Repository: rychljir/dp_satnav
Catalog: Satnav/*.lproj/Localizable.strings
Languages: cs

# title_chapter01
source: Positioning
cs: Zaměření polohy

# title_chapter02
source: How satellite navigation work
cs: Princip satelitní navigace

# title_chapter03
source: Global navigation satellite systems (GNSS)
cs: Globální navigační systémy

# title_chapter04
source: Galileo project
cs: Projekt Galileo

# title_chapter05
source: Issues facing GNSS systems
cs: Problémy navigace

# title_chapter06
source: Practical applications
cs: Použití v praxi

# title_chapter07
source: The future on our doorstep
cs: Budoucnost za dveřmi

# title_chapter08
source: Augmented reality
cs: Rozšířená realita

# task_ok
source: Correct!
cs: Správně!

# task_fail
source: That's not it! Try again.
cs: Špatně! Zkus to znovu.

# task01_1_title
source: Positioning
cs: Princip určení polohy

# task01_1_text
source: When prehistoric man went hunting and found a mammoth, he needed to remember its position in order to come back with the whole band. Hunters used landmarks such as trees, lakes or mountains for positioning.
cs: Když pravěký člověk na lovu objevil mamuta, musel si zapamatovat, jak se k němu vrátit s celou tlupou. Lovci k orientaci využívali výrazné prvky v krajině, například strom, jezero či horu.

# task01_2_text
source: Later on, other ways of determining one's position in the landscape appeared. The invention of the compass and the creation of maps, used mainly in sea navigation, represented an important step forward. Besides natural landmarks, the landscape filled with man-made landmarks such as castles, churches and other structures.
cs: Později se objevily další způsoby, jak určit svou polohu v krajině. Významným krokem byl vynález kompasu a tvorba map, kterých se využívalo především při plavbách po moři. K přirozeným orientačním bodům v krajině se přidaly výtvory lidské činnosti jako hrady, kostely a další stavby.

# task01_3_text
source: Today, the GNSS system makes positioning easy. In addition to its positioning function, it helps us plan routes, and checks whether we observe speed limits.
cs: Dnes je určování polohy velmi jednoduché, hlavně díky satelitní navigaci. Ta nejen že umožňuje určit naši polohu, ale i naplánovat trasu, případně sledovat, zdali nepřekračujeme povolenou rychlost.

# task01_4_title
source: Measuring tools of the past
cs: Nástroje měření v minulosti

# task01_4_text
source: As human society developed, people needed to measure distances and determine their position. New instruments made it possible to find out the distance to the nearest neighbouring town, or the area of a farmer's field. At sea, it wasn't possible to rely on landmarks, so sailors started using the stars for orientation.
cs: S postupným rozvojem lidské společnosti bylo zapotřebí začít měřit vzdálenosti a určovat svou polohu. Díky novým přístrojům bylo možné zjistit, jak daleko je do sousedního města, případně jak velké má sedlák pole. Na širém moři bylo nutné určovat polohu bez použití pevninských orientačních bodů, a tak se začali námořníci orientovat pomocí hvězd.

# task01_4_titleText1
source: Sextant and astrolabe
cs: Sextant a Astroláb

# task01_4_text1
source: Astrolabes were used to determine the position of the stars and the Sun. They could also be used inversely: you could infer your own position from the known position of the stars and the Sun. In the 18th century the astrolabe was replaced by the sextant. Even modern-day sailors learn how to use it in order to be able to determine their position at sea in case the GNSS system fails.
cs: Pomocí astrolábu se dříve určovala poloha hvězd a Slunce. Bylo možné jej použít i naopak, tedy ze známé polohy hvězd a Slunce určit svou polohu. V 18. století byl astroláb nahrazen sextantem. S ním se námořníci učí pracovat i dnes, aby se v případě výpadku satelitní navigace dokázali na moři orientovat.

# task01_4_titleText2
source: Surveyor's wheel
cs: Hodometr

# task01_4_text2
source: The surveyor's wheel, or hodometer, was a simple tool for measuring distance. Using it was as easy as walking the distance, running the wheel on the ground and counting its rotations. By multiplying the number of rotations by the circumference of the wheel you got the required distance.
cs: Jednoduchým nástrojem na určování vzdálenosti byl hodometr. Jednoduše stačilo jít po trase s “kolem” a počítat otáčky. Po vynásobení počtu otáček obvodem kola se získala požadovaná délka trasy.

# task01_4_titleText3
source: Jacob's staff
cs: Jakubová hůl

# task01_4_text3
source: Jacob's staff was a simple measuring tool based on the principle of similarity of triangles. It was composed of a main staff and sliding transoms. It was mainly used by astronomers, surveyors and navigators to measure distance and height.
cs: Jakubova hůl sloužila jako jednoduchý měřicí přístroj, který využíval principu podobnosti trojúhelníků. Skládal se z tyče a posuvných ramen. V minulosti s ním pracovali především astronomové, zeměměřiči a navigátoři při měření vzdáleností a výšek.

# task01_5_title
source: Measuring and positioning instruments today
cs: Nástroje (za)měření dnes

# task01_5_text
source: Today, there are two key positioning principles. The first principle consists in measuring the time it takes for a signal to travel from a transmitter to a receiver. The GNSS system and mobile positioning, for example, are based on this principle. The second principle consists in measuring the time it takes for a signal reflected from an object to get back to the transmitter. This is the principle used for radars and laser measurements in surveying.
cs: V dnešní době je měření polohy spojené hlavně se dvěma základními principy. Prvním je měření doby, za kterou signál dorazí od vysílače k přijímači – sem patří např. satelitní navigační systém, nebo zaměřování pomocí mobilních sítí. Druhým principem je měření doby, za níž se vyslaný signál, který se odrazí od objektu, vrátí zpět k vysílači. Tohoto principu využívají např. radary nebo laserová měření v geodézii.

# task01_5_titleText1
source: Mobile networks
cs: Wi-Fi

# task01_5_text1
source: It is possible to determine the position of a mobile phone from the position of signal transmitters. This method is used to locate car accident sites or to search for missing persons. The accuracy of this method is in the order of hundreds, sometimes tens of metres.
cs: Pomocí GPS v mobilních telefonech a tabletech dojde k zaměření Wi-Fi routeru a uložení jeho polohy a identifikačních údajů. Když pak prochází kolem tohoto routeru osoba s mobilním telefonem, může být zpětně určena její poloha. Přesnost této metody se liší podle počtu routerů, které se v okolí zařízení nacházejí. Pohybuje se od několika metrů po decimetry. Díky husté síti signálů až z desítek routerů funguje velmi dobře ve městech.

# task01_5_titleText2
source: Satellites
cs: Sonar

# task01_5_text2
source: The GNSS system is the most advanced positioning method, its accuracy ranging from hundreds of metres to several centimetres.
cs: Na rozdíl od většiny ostatních metod, které různou formou využívají elektromagnetické záření, funguje sonar na principu ultrazvuku. Sonarů se využívá především při rybolovu, obecně pak určování polohy objektů pod hladinou. Jejich přesnost se pohybuje v řádu metrů až centimetrů.

# task01_5_titleText3
source: Surveying
cs: Satelity

# task01_5_text3
source: Surveyors are able to provide very precise distance measurements. Using their equipment, mostly laser instruments, they are able to measure buildings to within several decimetres or even centimetres.
cs: Nejmodernější způsob zaměření polohy je satelitní navigace s přesností od několika set metrů až po jednotky centimetrů.

# task01_5_titleText4
source: Radar
cs: Geodézie

# task01_5_text4
source: Radars can determine the distance of an object by emitting a signal and receiving it back after it is reflected from the object. Depending on their use and range, radars measure with an accuracy varying between several kilometres and several tens of metres.
cs: Při velmi přesném určování vzdáleností se využívá práce geodetů. Ti jsou pomocí svých přístrojů, nejčastěji laserů, schopni zaměřovat např. budovy s přesností decimetrů až centimetrů.

# task01_5_titleText5
source: Sonar
cs: Mobilní sítě

# task01_5_text5
source: Unlike most of the other methods, which use electromagnetic radiation in some way or other, the sonar works with ultrasound. Sonars are mostly used in fishing and, more generally, to locate objects under water. Their accuracy ranges from metres to centimetres.
cs: Z polohy vysílačů signálu je možné určit polohu mobilního telefonu. Tato metoda se používá při určování místa dopravní nehody nebo při pátrání po pohřešované osobě. Přesnost se pohybuje v řádu stovek, případně i desítek metrů.

# task01_5_titleText6
source: Wi-Fi
cs: Radar

# task01_5_text6
source: GPS modules in mobile phones and tablets are used to determine the position of a Wi-Fi router and save its position and identification data. When a person carrying a mobile phone passes by the router, his or her position can be determined. The accuracy of this method varies depending on the number of routers located near the device. It ranges from metres to centimetres. This positioning method works very well in cities thanks to the dense network of signals from dozens of routers.
cs: Pomocí vysílání signálu a jeho zpětného odrazu od objektu je možné určit vzdálenost objektu. Přesnost radarů v návaznosti na jejich použití a dosah se pohybuje v řádech kilometrů až desítek metrů.

# task01_7_text
source: Drag the marks to indicate the accuracy of each positioning method:
cs: Roztažením vyznač přesnost jednotlivých metod určení polohy:

# task01_7_rsb4_caption
source: Satellite navigation
cs: Satelitní navigace

# task02_1_title
source: GNSS segments
cs: Segmenty satelitních navigačních systémů

# task02_1_capt_a
source: Space segment
cs: Kosmický segment

# task02_1_capt_b
source: Control segment
cs: Řídící segment

# task02_1_capt_c
source: User segment
cs: Uživatelský segment

# task02_1_desc_a
source: The space segment is the backbone of all GNSS systems. It is a system of satellites that send information about their current position and time towards the Earth's surface. The space segment also includes satellite carriers and spaceports.
cs: Páteří satelitních navigačních systémů je kosmický segment. Tvoří ho soustava satelitů posílajících na Zemi informace o své poloze a aktuálním čase. Do kosmického segmentu patří rovněž rakety, dopravující satelity do vesmíru, a kosmodromy, ze kterých rakety startují.

# task02_1_desc_b
source: The control segment coordinates the operation of satellites, works on improving GNSS systems and explores new possibilities of their application. In the European Union, the control segment is under the remit of the European GNSS Agency (GSA), based in Prague.
cs: Řídící segment koordinuje provoz satelitů, snaží se systém satelitní navigace zlepšovat a hledat další možnosti jeho použití. V rámci Evropské unie má řídící segment na starosti agentura GSA (European GNSS Agency) se sídlem v Praze.

# task02_1_desc_c
source: A typical GNSS application for a common user is car navigation or navigation using a mobile phone. In addition to their usual function – determining the position and speed of selected objects – GNSS systems with their very accurate measurement of time are used e.g. for financial transactions. You will find more examples of practical applications in the following chapters.
cs: Se satelitní navigací se běžný člověk (uživatel) setká nejčastěji při navigaci pomocí mobilního telefonu nebo v automobilu. Kromě svého obvyklého použití – určování polohy a rychlosti zvolených objektů – se satelitní navigace díky přesnému měření času používá např. i pro finanční transakce. Jiné příklady použití v praxi naleznete v dalších kapitolách.

# task02_2_title
source: Measurements using four satellites
cs: Měření pomocí čtyř satelitů

# task02_2_desc
source: Signals from three satellites whose position we know should be enough to determine our position on the Earth's surface. They would give us the <i>x</i>, <i>y</i> and <i>z</i> coordinates, or the corresponding latitude, longitude and altitude of the place where we are standing. In reality, however, signals from four satellites are needed because time is used to measure the distance from the satellites, and receivers are not able to measure time with sufficient accuracy.
cs: Pro určení polohy na povrchu Země by nám měly stačit signály ze tří satelitů se známou polohou. Určili bychom tak souřadnice <i>x</i>, <i>y</i>, <i>z</i> nebo jim odpovídající zeměpisnou šířku, délku a nadmořskou výšku místa, kde senacházíme. Ve skutečnosti jsou ale potřeba signály ze čtyř satelitů, jelikož vzdálenost od satelitů se určuje pomocí času, který přijímač neměří tak přesně.

# task02_3_title
source: Positioning principles
cs: Princip určení polohy

# task02_3_desc
source: The exact time does not play the key role in positioning; in fact, time is the factor causing the most significant inaccuracies. First, let's see how we would determine our position using three satellites and measuring time on the receiver. Each satellite carries a set of very accurate clocks and knows its own position in the Earth's orbit. It sends this information to receivers on Earth.
cs: Přesný čas hraje klíčovou roli při určování polohy, může totiž způsobit největší nepřesnosti. Nejprve ukažme, jak by vypadalo určení polohy přijímače pomocí tří satelitů a času na přijímači. Každý satelit obsahuje sadu přesných hodin a zná svou polohu na oběžné dráze kolem Země. Tyto informace odesílá přijímačům na Zemi.

# task02_4_title
source: Positioning principles
cs: Princip určení polohy

# task02_4_desc
source: So a satellite sends information about its position and the time the signal was sent, along with some additional information, towards the Earth's surface. The information is received by a GNSS receiver, which records the time the signal was received, the time it was sent by the satellite, and the position of the satellite at the moment the signal was sent. Unlike satellites, receivers do not measure time with sufficient accuracy (very accurate clocks such as those carried by satellites are too expensive and would dramatically increase the cost of the receiver). As a result, the time of reception is not determined accurately. <i>t</i> <small><sub>t</sub></small> ...the time a signal is sent from the satellite <i>t</i> <small><sub>r</sub></small> ...the time a signal is received by the receiver
cs: Satelit tedy vyšle údaje o své poloze, času odeslání a další doplňující informace směrem k povrchu Země. Zde je zachytí přijímač satelitní navigace, který zaznamená čas přijetí signálu, čas odeslání ze satelitu a polohu satelitu při odeslání. Oproti satelitům neměří přijímač čas zcela správně (velmi přesné hodiny, které obsahuje satelit, jsou příliš drahé a mnohonásobně by zvýšily cenu přijímačů). Určení času přijetí tedy není přesné. <i>t</i><small><sub>t</sub></small> ...čas odeslání signálu ze satelitu <i>t</i><small><sub>r</sub></small> ...čas přijetí signálu v přijímači

# task02_5_title
source: Positioning principles
cs: Princip určení polohy

# task02_5_desc
source: The receiver then determines the time difference Δ<i>t</i> between the time a signal is received (<i>t</i><small><sub>r</sub></small>) and the time it is sent from the satellite (<i>t</i><small><sub>t</sub></small>). This difference is very small: between 70 and 100 ms. t<small><sub>t</sup> ...the time a signal is sent from the satellite t<small><sub>r</sub></small> ...the time a signal is received by the receiver Δt ...the time difference between the time a signal is sent from the satellite and the time it is received by the receiver
cs: Přijímač nyní určí dobu Δ<i>t</i> mezi časem, kdy byl signál přijat (<i>t</i><small><sub>r</sub></small>) a časem, kdy byl signál vyslán ze satelitu (<i>t</i><small><sub>t</sub></small>). Tento rozdíl je velmi malý a pohybuje se v intervalu od 70 do 100 ms. <i>t</i><small><sub>t</sub></small> ...čas odeslání signálu ze satelitu <i>t</i><small><sub>r</sub></small> ...čas přijetí signálu v přijímači Δ<i>t</i> ...doba mezi odesláním signálu satelitem a jeho přijetím přijímačem

# task02_6_title
source: Positioning principles
cs: Princip určení polohy

# task02_6_desc
source: Signals from satellites are propagated in the form of electromagnetic waves (i.e. they have the speed of light*). By knowing the difference between the time a signal was sent from the satellite and the time it was received, the receiver is able to determine its own distance from each satellite. Since receiver clocks are several times less accurate than satellite clocks, even the difference Δ<i>t</i> cannot be determined with accuracy. Thus we don't know the exact distance of the receiver form the satellite; we only know an interval of distance in which the receiver is located. Ideally, a satellite signal is propagated in a uniform linear motion. *More detailed information is provided in the chapter about GNSS problems.
cs: Signál z navigační družice se šíří v podobě elektromagnetické vlny (šíří se tedy rychlostí světla*). Ze znalosti doby mezi odesláním signálu satelitem a jeho přijetím přijímačem může přijímač určit svou vzdálenost od jednotlivých satelitů. Jelikož jsou hodiny na přijímači několikanásobně méně přesné než na satelitu, tak ani dobu Δ<i>t</i> nelze určit zcela správně. Neznáme tedy přesnou vzdálenost přijímače od satelitu, ale pouze interval vzdálenosti, v níž se přijímač nachází. V ideálním případě se totiž signál družice šíří rovnoměrně přímočarým pohybem. *Přesněji rozebráno v problémech navigace.

# task02_7_title
source: Positioning principles
cs: Princip určení polohy

# task02_7_desc
source: So now our receiver knows the intervals of distance separating it from each satellite. It also knows the position of the satellites at the time they sent their signals. It can therefore determine the area within which it is located. In mathematical terms, this area is an intersection of parts of spherical cones (with their centres in each of the satellites). To calculate the coordinates, we need to solve three equations with three unknowns. To simplify, we can write down these equations using the Cartesian coordinates <i>x</i>, <i>y</i>, <i>z</i> (see image).
cs: Přijímač již nyní ví, v jakých intervalech vzdáleností se od jednotlivých satelitů nachází. Zná také polohu těchto satelitů při vyslání signálu. Může tedy určit oblast, ve které se vyskytuje. Tato oblast je matematicky průnik částí kulových výsečí (se středem v jednotlivých satelitech). Početně se jedná o výpočet tří rovnic o třech neznámých. Pro zjednodušení můžeme rovnice napsat v kartézských souřadnicích <i>x</i>, <i>y</i>, <i>z</i> (viz obrázek).

# task02_8_title
source: Positioning principles
cs: Princip určení polohy

# task02_8_desc
source: In real life, receivers solve the equations using spherical coordinates, converting them to the commonly used geographical coordinates: latitude, longitude and altitude. With three satellites it is possible to locate a receiver to within a few hundred metres.
cs: Ve skutečnosti přijímač počítá rovnice ve sférických souřadnicích, které poté převádí na běžně používané zeměpisné souřadnice – zeměpisnou šířku a délku a nadmořskou výšku. Pomocí tří satelitů je možné lokalizovat přijímač s přesností v řádu stovek metrů.

# task02_9_title
source: Positioning principles
cs: Princip určení polohy

# task02_9_desc
source: The most significant positioning error is caused by the receiver clock. To remove this error, the signal from a fourth satellite is needed. People often say that 'the fourth satellite sends time but, in fact, it sends the same information as the other three satellites.
cs: Největší chybu v určení polohy způsobují hodiny přijímače. Aby se tato chyba odstranila, je potřeba zachytit signál ze čtvrtého satelitu. Obvykle se říká, že “čtvrtý satelit posílá čas”, ve skutečnosti posílá stejné informace jako předchozí tři satelity.

# task02_10_title
source: Positioning principles
cs: Princip určení polohy

# task02_10_desc
source: Information from a fourth satellite enables the receiver to precise the reception times (and also the receiver clock time) using numerical calculations. Put simply: there are four unknowns: the <i>x</i>, <i>y</i> and <i>z</i> coordinates, and the clock error <i>t</i>. For these unknowns we have four equations (see image). These calculations make it possible to precise the position to within several tens of metres or even several metres.
cs: Díky signálu ze čtvrtého satelitu může přijímač pomocí numerických výpočtů zpřesnit časy přijetí (a také čas na hodinách přijímače). Zjednodušeně: máme čtyři neznámé – souřadnice <i>x</i>, <i>y</i>, <i>z</i> a chybu hodin <i>t</i>, a pro ně čtyři rovnice (viz obrázek). Těmito výpočty je možné zpřesnit určení polohy na desítky až jednotky metrů.

# task02_11_title
source: Positioning principles
cs: Princip určení polohy

# task02_11_desc
source: If a receiver 'sees more satellites, this makes it possible to precise the position to within a couple of metres. In addition to satellites, we can use satellite-based augmentation systems such as EGNOS, and their network of ground stations. Such augmentation systems make it possible to determine one's position to within several centimetres.
cs: Vidí-li přijímač další satelity, je možné zvýšit přesnost určení polohy až na jednotky metrů. Kromě satelitů lze využít i systému pozemních stanic zpřesňujících navigačních systémů jako je EGNOS. S využitím těchto podpůrných systémů můžeme určit polohu v řádu cm.

# task02_12_title
source: Accurate measurement of time
cs: Přesné měření času

# task02_12_desc
source: GNSS systems need to measure time with extreme accuracy in order to work well. Since a satellite signal travels at the speed of light, even an inaccuracy corresponding to a thousandth of a second means a 300 km difference. This is about the distance from Prague to Berlin. Atomic clocks used in navigation satellites are so accurate that even if they had been used since the beginning of the universe, they would differ by only two seconds today. c = 299 792 458 m/s
cs: Ke správnému fungování satelitní navigace je nutné velmi přesné určení času. Protože se signál z družice šíří rychlostí světla, už chyba v tisícině sekundy znamená rozdíl 300 km. To přibližně odpovídá vzdálenosti z Prahy do Berlína. Atomové hodiny používané v navigačních družicích jsou tak přesné, že pokud by běžely od vzniku vesmíru, rozcházely by se dnes o pouhé dvě sekundy. c = 299 792 458 m/s

# task02_13_title
source: Task
cs: Úloha

# task02_13_desc
source: If a satellite clock lost or gained time, it would be interesting to try and estimate the distance a signal from this satellite travelled during this time. Estimate the distance that light travels in
cs: Pokud by se hodiny satelitu zpožďovaly nebo předbíhaly, bylo by zajímavé pokusit se odhadnout vzdálenost, kterou by signál ze satelitu za tento čas urazil. Odhadněte, jakou vzdálenost urazí světlo za

# task02_13_hint
source: Hint: What is the speed of the signal?
cs: Nápověda: Jakou rychlostí se signál pohybuje?

# task03_1_title
source: GNSS overview
cs: Přehled satelitních navigačních systémů

# task03_1_text
source: Look at the orbits of different GNSS systems.
cs: Prohlédněte si dráhy jednotlivých satelitních systémů.

# task03_2_stats
source: Number of satellites: 12 Orbital altitude: 23 220 km Orbital period: 14,08 h Orbital speed: 3 670 m/s
cs: Počet satelitů: 12 Oběžná výška: 23 220 km Oběžná doba: 14,08 h Oběžná rychlost : 3 670 m/s
