Repository: rychljir/dp_satnav
Catalog: Satnav/*.lproj/Localizable.strings
Languages: cs

# task05_8_text
source: Another type of inaccuracy that needs compensation is described in the general theory of relativity. Since the Earth's mass is relatively big (6 * 10<small><sup>24</sup></small> kg), spacetime is deformed in its vicinity. This is why time passes faster in orbit than it passes on the Earth's surface. This effect is much more pronounced e.g. in black holes.
cs: Další nepřesnost, kterou je potřeba korigovat, je chyba popsaná v obecné teorii relativity. Jelikož má Země relativně vysokou hmotnost (6 * 10<small><sup>24</sup></small> kg), dochází v jejím okolí k deformaci prostoročasu. Proto plyne čas v místě, kde obíhá satelit, rychleji, než na povrchu Země. Tento efekt je mnohem názorněji vidět např. u černých děr.

# task05_9_desc
source: Match the effects that may have a negative impact on GNSS systems with their sources.
cs: Přiřaďte jevy, které mohou činit satelitní navigaci problémy, k jejich zdrojům.

# task05_9_a1
source: Special theory of relativity
cs: Speciální teorie relativity

# task05_9_b1
source: Satellite clocks losing time
cs: Zpožďování hodin satelitu

# task05_9_a2
source: General theory of relativity
cs: Obecná teorie relativity

# task05_9_b2
source: Satellite clocks gaining time
cs: Předbíhaní hodin satelitu

# task05_9_a3
source: Space objects and space junk
cs: Vesmírná tělesa a kosmické smetí

# task05_9_b3
source: Physical damage to a satellite
cs: Fyzické poškození satelitu

# task05_9_a4
source: Solar storm
cs: Solární bouře

# task05_9_b4
source: Damage to electronic equipment, signal noise
cs: Vyřazení elektroniky šum signálu

# task05_9_a5
source: Ionosphere
cs: Ionosféra

# task05_9_b5
source: Signal refraction
cs: Lom (refrakce) signálu

# task05_9_a6
source: The Earth's surface
cs: Povrch Země

# task05_9_b6
source: Signal reflection
cs: Odraz signálu

# task05_9_a7
source: Gravitational action of the Moon, the Sun and the Earth
cs: Gravitační působení Měsíce, Slunce a Země

# task05_9_b7
source: Deflection of a satellite from its pre-calculated position
cs: Odchýlení satelitu z předem vypočítané polohy

# task05_9_a8
source: Radiation pressure
cs: Tlak záření

# task05_9_b8
source: Deflection of a satellite away from the Sun
cs: Odchýlení satelitu směrem od Slunce

# task06_1_title
source: Vehicles and vehicle traffic
cs: Automobily a automobilová doprava

# task06_1_capt_a
source: Toll collection
cs: Výběr mýtného

# task06_1_capt_b
source: Navigation
cs: Navigace

# task06_1_desc_a
source: GNSS enables tracking truck routes and calculate the toll based on the distance travelled. This solution allows building tolling systems without toll gates. Similarly, it would be possible to impose toll on other types of motor vehicles.
cs: Pomocí GNSS je možné sledovat trasy nákladních automobilů a z ujeté vzdálenosti následně vypočítávat výši mýtného. Díky tomuto řešení odpadá potřeba mýtných bran. Obdobně by bylo možné zavést mýtné i pro ostatní motorová vozidla.

# task06_1_desc_b
source: Today, many drivers cannot imagine driving without using navigation. Navigation is integrated into modern cars, and drivers can choose out of various routes to their destination.
cs: Dnes by si již řada řidičů nedokázala bez navigace cestování autem představit. Integrovaná navigace je součástí dnešních automobilů, stejně jako výběr z několika různých tras, kterými je možné se dostat na místo určení.

# task06_1_desc_c
source: eCall is a system which is installed in some of the new cars. This system sends a signal to the rescue services with information about the position of the vehicle in case of an accident.
cs: Do vybraných automobilů se v současné době instaluje tzv. eCall. Toto zařízení umožňuje v případě nehody vyslat signál záchranným složkám s aktuální polohou vozu.

# task06_2_title
source: Railway traffic
cs: Železniční doprava

# task06_3_title
source: Air traffic
cs: Letecká doprava

# task06_4_title
source: Maritime traffic
cs: Námořní doprava

# task06_5_title
source: Hiking
cs: Turistika

# task06_5_capt_b
source: Geolocation games
cs: Geolokační hry

# task06_5_capt_c
source: Hiking
cs: Turistika

# task06_5_desc_a
source: Since the intentional mistake was removed from GPS, it became possible to identify location with a very high level of precision - up to a few meters. This gave birth to a game halfway between a sport and hiking - the players have to use geographic coordinates to find a cache - usually, a durable box with a logbook and various objects left by previous players.
cs: Jelikož byla z GPS odstraněna záměrná chyba, bylo možné začít určovat polohu s velmi velkou přesností – na jednotky metrů. Díky tomu mohla vzniknout hra na pomezí sportu a turistiky, jejímž cílem je na základě zeměpisných souřadnic najít cache - obvykle odolnou krabičku s logbookem (deníkem) a různými předměty, které do ní vkládají nálezci.

# task06_5_desc_b
source: Besides geocaching, hikers can try a whole array of geolocation games which can guide them through a town or a landscape, or be used as a teaching method at school.
cs: Kromě geocachingu je možné vyzkoušet si celou řadu geolokačních her, které mohou turisty provést městem či krajinou, případně je lze využít během školní výuky.

# task06_5_desc_c
source: GNSS has also changed hiking. GNSS is already integrated into most new mobile phones. The possibility of downloading offline maps is a great advantage. With navigation, a lost hiker will easily find his way. It is also practical that GNSS allows to establish the exact location in case of an accident or an injury.
cs: Satelitní navigace také změnila běžnou turistiku. Ve většině nových mobilních telefonů je satelitní navigace již integrovaná. Velkou výhodou je možnost stažení offline map. Ztracený turista tak díky navigaci snadno dorazí do cíle. Praktická je rovněž možnost určení své přesné polohy v případě nehody či zranění.

# task06_6_title
source: Environmental protection
cs: Ochrana životního prostředí

# task06_6_capt_a
source: Fauna protection and tracking
cs: Ochrana a sledování živočichů

# task06_6_capt_b
source: Flora mapping
cs: Mapování rostlin

# task06_6_capt_c
source: Tracking of natural processes
cs: Sledování přírodních procesů

# task06_6_desc_a
source: GNSS can be used for mapping fauna, especially, some of the protected species. It is also interesting, for example, to track migration routes of migratory birds and discover their wintering places.
cs: Satelitní navigaci lze využít při mapování živočichů, zejména pak chráněných druhů. Zajímavé je například sledování migračních tras stěhovavých ptáků a určování míst jejich zimovišť.

# task06_6_desc_b
source: Similarly to animals, plants can also be mapped exactly in remote areas.
cs: Obdobně jako u živočichů je možné provádět přesné mapování rostlin v obtížně dostupných oblastech.

# task06_6_desc_c
source: GNSS also allows to study inanimate nature. Devices have reached such high levels of precision that it is possible to track litospheric plate movements, glacier retreat, oceanic current direction and many other natural phenomena.
cs: Satelitní navigací lze studovat i neživou přírodu. Přístroje dosáhly takové přesnosti, že je možné zaznamenávat pohyby litosférických desek, ubývání ledovců, směry oceánského proudění a mnohé další jevy.

# task06_7_desc
source: GNSS has a very wide range of applications. Match the pictures with the correct description.
cs: Použití satelitní navigace v praxi je velmi široké. Přiřaďte k obrázkům správné popisky.

# task06_7_1
source: Toll collection
cs: Výběr mýtného

# task06_7_2
source: Tracking of natural processes
cs: Sledování přírodních procesů

# task06_7_4
source: Calling for help
cs: Přivolání pomoci

# task06_7_5
source: Flora mapping
cs: Mapování rostlin

# task06_7_6
source: Fauna migration tracking
cs: Sledování migrace zvířat

# task07_1_title
source: Self-driving vehicles
cs: Samonaváděné automobily

# task07_1_text
source: GNSS opens way to self-driving vehicles. The car can be tracked en route and if any complications arise, changing the planned route is easy. Besides GNSS, the cars have many other systems to adjust the navigation. Those include, for instance, sensors determining the distance towards other cars and objects or cameras monitoring movement within the given lane. If GNSS becomes standard equipment of a car, it will be easier to optimize traffic and monitor safety automatically. Autonomous systems are able to quickly evaluate and respond to critical situations. The problem is in the third party liability in case of an accident - whether the liability is imposed on the driver or on the car manufacturer who developed the autonomous system. Cargo transportation can be a separate chapter in the development of autonomous systems because such systems can make drivers redundant. This could help drive transportation costs significantly lower.
cs: Satelitní navigace otevírá cestu k samonaváděným automobilům. Automobil je možné sledovat v průběhu cesty a v případě nečekané komplikace na plánované trase je snadné ji změnit. Kromě satelitní navigace mají automobily řadu dalších systémů korigujících navigaci. Jsou jimi například senzory vzdálenosti od jiných vozidel a objektů nebo kamery hlídající jízdu v daném pruhu. Pokud se satelitní navigace stanou standardní výbavou automobilů, bude snazší optimalizovat provoz a automaticky hlídat jeho bezpečnost. Autonomní systémy jsou totiž schopné rychle vyhodnocovat a reagovat na kritické situace. Problémem je ovšem právní odpovědnost v případě nehody – nese-li ji řidič automobilu nebo automobilka, která autonomní systém řízení vyvinula. Samostatnou kapitolou je nákladní přeprava, ve které již díky tomuto systému nebude potřeba řidičů. Náklady by se tak mohly výrazně snížit.

# task07_2_title
source: Self-driving trains
cs: Samonaváděné vlaky

# task07_2_text
source: Rail traffic is a system which can experience significant changes due to GNSS. As trains can only ride on tracks, autonomous systems would be much easier to introduce. Tracking and control will be performed remotely. During the first stage, autonomous systems will be introduced in cargo transportation; passenger trains will follow suit. We can look forward to the era when trains will carry goods automatically, or even when a train would recognize a hurrying passenger and wait for him for a few seconds.
cs: Železniční doprava je odvětví, ve kterém se dají očekávat díky satelitní navigaci výrazné změny. Jelikož trasa pohybu vlaku je dána kolejemi, je zavedení autonomních systémů daleko snazší. Vlaky lze lépe monitorovat a ovládat na dálku. V první fázi dojde k aplikaci systémů na nákladní dopravu. Následně pak i na dopravu osobní. Můžeme se tak těšit na dobu, kdy budou vlaky automaticky rozvážet zboží, nebo dokonce kdy vlak pozná dobíhajícího cestujícího a pár sekund na něj počká.

# task07_3_title
source: Autonomous aircraft
cs: Samonaváděná letadla

# task07_3_text
source: Already today, many aircraft are equipped for automatic landing. Automatic collision avoidance systems are used to change the route of an aircraft. Even today, it would be entirely possible to aviate the whole flight using GNSS. Psychologically, thought, passengers of an aircraft feel safer when a pilot is in the cockpit.
cs: Již dnes je běžné, že letadla na letištích přistávají zcela automaticky. Rovněž tímto způsobem dochází k odklonění tras v případě, že hrozí srážka. Řídit pomocí satelitní navigace celý let by bylo i v tento okamžik naprosto bezproblémové. Psychologicky se ovšem pasažéři na palubě letadla cítíbezpečněji v přítomnosti pilota v kabině.

# task07_4_title
source: Parcel delivery - robots and quadcopters
cs: Doručování zásilek - roboti a kvadrokoptéry

# task07_4_text
source: Navigated robots and quadcopters will be delivering parcels to any given destination and we will be able to pinpoint their real-time location. Statistics of parcel pick-up and deliver will enable us to optimize the number of drones and robots necessary to service a given area. The great advantage of quadcopters is rapid accessibility of locations with frequent traffic jams.
cs: Pomocí navigovaných robotů a kvadrokoptér bude možné doručovat zásilky na libovolné místo a sledovat v reálném čase jejich aktuální polohu. Statistiky vyzvedávání a doručování zásilek umožní optimalizovat množství robotů a dronů potřebných pro danou oblast. Velkou výhodou kvadrokoptér je rychlá dosažitelnost lokalit s častými dopravními zácpami.
