Repository: rychljir/dp_satnav
Catalog: Satnav/*.lproj/Localizable.strings
Languages: cs

# task03_2_desc
source: The Galileo project, funded by the European Union, is the most important European satellite navigation project. It is being implemented by the European Space Agency (ESA) and the European GNSS Agency (GSA). The Galileo system is still under construction. You will learn more in a dedicated chapter.
cs: Nejvýznamnějším evropským počinem na poli satelitní navigace je projekt Galileo financovaný Evropskou komisí. Na jeho realizaci se podílí ESA (Evropská vesmírná agentura) a GSA (Agentura pro evropský GNSS). Galileo je stále ve fázi výstavby. Více se dozvíte v samostatné kapitole.

# task03_3_stats
source: Number of satellites: 31 Orbital altitude: 20 180 km Orbital period: 11,97 h Orbital speed: 3 870 m/s
cs: Počet satelitů: 31 Oběžná výška: 20 180 km Oběžná doba: 11,97 h Oběžná rychlost : 3 870 m/s

# task03_3_desc
source: People often use the terms "GNSS" and "GPS" interchangeably. However, GPS (Global Positioning System) is the name of one specific GNSS, run by the USA. In the beginning, it was used exclusively by the US Army. One of the reasons for launching GPS was the need to locate (nuclear) submarines after the fuel was burned up. Later on, the scope of application extended: in 1983, GPS was approved for civilian use to become fully operational in 1995. Today, GPS modules are integral parts of most modern mobile devices.
cs: Mezi uživateli se běžně zaměňují pojmy &#8222;satelitní navigace&#8220; a &#8222;GPS&#8220;. Americký GPS (Global Positioning System, globální polohový systém) je ovšem jen jeden z navigačních systémů. Nejprve sloužil pouze pro armádu USA. Jedním z prvních důvodů pro zavedení GPS bylo určení přesných poloh (atomových) ponorek po vynoření. Později se aplikace GPS rozšiřovala – v roce 1983 byla uvolněna i pro civilní použití a plně funkční se stala v roce 1995. Nyní už jsou GPS moduly nedílnou součástí většiny moderních mobilních zařízení.

# task03_4_title
source: GPS inaccuracy
cs: Nepřesnost GPS

# task03_4_text
source: When GPS was released for civilian use, it included a feature called "Selective Availability" (SA), which added intentional positioning error to the signal. This resulted in inaccurate positioning, the error being in the order of tens to hundreds of metres. When the huge potential of GPS for people's everyday lives became apparent in 2000, this error feature was switched off. There are plans to completely eliminate this systemic error in future generations of GPS.
cs: Když byl systém GPS uvolněn pro civilní použití, obsahoval signál záměrnou chybu v určení polohy – tzv. Selective Availability (SA). Ta způsobovala, že určení polohy bylo velmi nepřesné – chyba činila řádově desítky až stovky metrů. Když se ukázalo, že GPS má velký potenciál pro využití v každodenním životě lidí, byla tato uměle vytvořená nepřesnost v roce 2000 vypnuta. Do budoucna se plánuje, že vnášení záměrné systémové chyby bude u nové generace GPS zcela zrušeno.

# task03_5_stats
source: Number of satellites: 24 Orbital altitude: 19 130 km Orbital period: 11,26 h Orbital speed: 3 950 m/s
cs: Počet satelitů: 24 Oběžná výška: 19 130 km Oběžná doba: 11,26 h Oběžná rychlost : 3 950 m/s

# task03_5_desc
source: GLONASS is an acronym standing for Globalnaya navigatsionnaya sputnikovaya sistema. The system was created in the USSR in 1976 to compete with the American GPS. In 2010 it became operational on the Russian territory, and its worldwide operation started a year later. Today, most devices with GPS modules are able to process signals from both GPS and GLONASS. It is faster and more accurate to determine position when signals from more than one GNSS are used.
cs: GLONASS je zkratkou názvu Globalnaya navigatsionnaya sputnikovaya sistema. Systém vznikl roku 1976 v tehdejším SSSR jako konkurence amerického systému GPS. Na ruském území začal systém fungovat v roce 2010, na celém světě pak o rok později. V současnosti je velká část přístrojů s GPS modulem schopna zpracovat jak signál GPS, tak GLONASS. Určení polohy se signály z více navigačních systémů je rychlejší a přesnější.

# task03_6_stats
source: Number of satellites: 20 Orbital altitude: 21 150 km Orbital period: 12,63 h Orbital speed: 3 800 m/s
cs: Počet satelitů: 20 Oběžná výška: 21 150 km Oběžná doba: 12,63 h Oběžná rychlost : 3 800 m/s

# task03_6_desc
source: This Chinese system, its full name being Beidou Navigation Satellite System, was originally created with five Beidou-1 geostationary satellites. They only served China's territory. The new generation GNSS, built since 2007, covers the whole planet and is sometimes called BeiDou-2. Before the launch of BeiDou-2, China was interested in participation in the Galileo project. However, the Chinese finally decided to create their own GNSS.
cs: Jedná se o čínský systém, celým názvem Beidou Navigation Satellite System, který původně vznikl na základě pěti geostacionárních satelitů Beidou-1. Ty obsluhovaly pouze území Číny. Navigační systém nové generace, budovaný od roku 2007 a pokrývající již celý svět, je někdy označován jako BeiDou-2. Před výrobou Beidou-2 měla Čína zájem podílet se na projektu Galileo. Nakonec se ale rozhodla vytvořit si vlastní systém satelitní navigace.

# task03_7_stats
source: Number of satellites: 5 Orbital altitude: 35 790 km Orbital period: 23,93 h Orbital speed: 3 070 m/s
cs: Počet satelitů: 5 Oběžná výška: 35 790 km Oběžná doba: 23,93 h Oběžná rychlost : 3 070 m/s

# task03_7_desc
source: IRNSS stands for "Indian Regional Navigation Satellite System. The decision to develop its own system was driven by India's desire to be independent of other powers' systems. IRNSS uses geostationary satellites located above the equator, i.e. always at the same place relative to the Earth's surface. As a result, IRNSS now only covers the Indian subcontinent.
cs: IRNSS je zkratkou pro Indian Regional Navigation Satellite System. Hlavní motivací Indie k vývoji vlastního systému byla nezávislost na stávajících systémech satelitní navigace jiných mocností. IRNSS využívá družice na geostacionární dráze, které se pohybují nad rovníkem, stále na stejném místě vůči zemskému povrchu. V současné době tedy IRNSS pokrývá pouze území indického subkontinentu.

# task03_8_title
source: Overview table
cs: Přehledová tabulka

# task03_8_table1_1
source: Navigation system
cs: Navigační systém

# task03_8_table2_1
source: Number of satellites
cs: Počet satelitů

# task03_8_table3_1
source: Orbital altitude
cs: Výška nad povrchem

# task03_8_table4_1
source: Orbital period
cs: Oběžná doba

# task03_8_table5_1
source: Orbital speed
cs: Rychlost oběhu

# task03_9_title
source: European Geostationary Navigation Overlay Service (EGNOS)
cs: Zpřesňující navigační systém pro Evropu – EGNOS

# task03_9_text
source: The accuracy of global navigation satellite systems is limited due to the fact that signals from the satellites are affected by the atmosphere as they pass through, and a number of physical effects act on the satellites themselves. Therefore, satellite-based augmentation systems (SBAS) have been designed to correct this inaccuracy. Europe uses the EGNOS system (European Geostationary Navigation Overlay Service), composed of two geostationary satellites and a network of ground stations. Since 2011 EGNOS has been used, for example, to assist in aircraft landing in selected airports.
cs: Protože signál z navigačních družic je při svém průchodu ovlivňován atmosférou, a na satelit samotný působí celá řada fyzikálních vlivů, je přesnost navigačních systémů omezená. Proto byly navrženy korekční systémy pro jejich zpřesnění – SBAS (Satellite Based Augmentation System). Evropa využívá systém EGNOS (European Geostationary Navigation Overlay Service), který tvoří dvě geostacionární družice a síť pozemních stanic. Od roku 2011 pomáhá EGNOS např. při přistávání letadel na vybraných letištích.

# task03_10_title
source: SBAS in the world
cs: Zpřesnění navigačních systémů ve světě

# task03_10_text_1
source: Besides EGNOS, there are several more SBAS-type systems in the world. They use geostationary satellites in combination with a system of ground stations and control centres.
cs: Kromě EGNOSu je ve světě ještě několik dalších korekčních systémů typu SBAS. Využívají geostacionárních družic, společně se systémem pozemních stanic a řídících středisek.

# task03_10_text_2
source: The best known systems are: WAAS, covering mainly the USA and North America; MSAS, covering Japan; GAGAN, covering India; and SDCM, covering Russia. There are also plans to introduce this type of system for South America and Africa.
cs: Mezi nejznámější sytémy patří WAAS pokrývající hlavně USA a Severní Ameriku, MSAS pokrývající Japonsko, GAGAN pokrývající Indii a SDCM pokrývající Rusko. Výhledově se plánuje rozšířit tento typ systému i na Jižní Ameriku a Afriku.

# task03_10_btn_1
source: EGNOS Europe
cs: EGNOS Evropa

# task03_10_btn_3
source: MSAS Japan
cs: MSAS Japonsko

# task03_10_btn_4
source: GAGAN India
cs: GAGAN Indie

# task03_10_btn_5
source: SDCM Russia
cs: SDCM Rusko

# task03_12_title
source: Task
cs: Úloha

# task03_12_task
source: Answer the following questions:
cs: Označ správné odpovědi:

# task03_12_yes
source: YES
cs: ANO

# task03_12_no
source: NO
cs: NE

# task03_12_q1
source: The EGNOS satellite-based augmentation system relies on satellites as well as ground stations.
cs: Zpřesňující navigační systém EGNOS používá jak geostacionární satelity, tak pozemní stanice.

# task03_12_q2
source: Galileo satellites have the highest orbital speed of all the GNSS systems mentioned.
cs: Nejrychleji obíhající satelity ze zmíněných navigačních systémů má Galileo.

# task03_12_q3
source: A geostationary satellite does not move relative to the stars.
cs: Geostacionární satelit se vůči hvězdám nepohybuje.

# task03_12_q4
source: Ideally, a geostationary satellite always stays at the same place relative to the Earth's surface.
cs: Geostacionární satelit zůstává v ideálním případě vůči povrchu Země stále na stejném místě.

# task03_12_q5
source: GNSS satellites orbit closer to the Earth's surface than the International Space Station (ISS)
cs: Satelity navigačních systémů obíhají blíže Zemi než Mezinárodní vesmírná stanice ISS.

# task03_12_q6
source: GPS has the highest number of satellites.
cs: Satelitní systém s největším počtem satelitů je GPS.

# task03_12_q7
source: The higher above the Earth's surface a satellite orbits, the higher the speed of the satellite.
cs: Čím výše je oběžná dráha satelitu od zemského povrchu, tím rychleji se satelit pohybuje.

# task04_1_title
source: Galileo GNSS
cs: Navigační systém Galileo

# task04_1_desc
source: The idea to create a European GNSS system dates back to the 1990s. The aim was to build a system independent of the then available military systems&#x2013; GPS and GLONASS, The first experimental Galileo satellite – GIOVE A – was launched in 2005. Galileo is a joint project of the European Space Agency and the European Commission. Its operation is currently the responsibility of the European Global Navigation Satellite Systems Agency (GSA). Unlike the other GNSS systems, Galileo is a civilian project.
cs: Koncept vlastního evropského navigačního systému začal vznikat během 90. let 20. století. Cílem bylo vytvořit nezávislý systém na tehdy dostupných vojenských navigačních systémech / GPS a GLONASS. První experimentální satelit projektu Galileo - GIOVE A byl vypuštěn v roce 2005. Galileo je společným projektem Evropské vesmírné agentury a Evropské komise. O jeho provoz se momentálně stará Agentura GSA (European Global Navigation Satellite Systems Agency). Na rozdíl od ostatních navigačních systémů je Galileo projekt nevojenský.

# task04_2_title
source: Four levels of Galileo
cs: Čtyři úrovně Galilea

# task04_2_header
source: Open Service (OS)
cs: Základní služba

# task04_2_desc
source: This is the basic positioning service, available to all Galileo users. The service is free of charge, so that he broadest possible spectrum of users can benefit from it.
cs: Jedná se o základní službu pro určení polohy, která je dostupná všem uživatelům Galilea. Služba je bez poplatků, aby ji mohlo využít co nejširší spektrum uživatelů.

# task04_3_header
source: Služba &#8222;kritická&#8220; z hlediska bezpečnosti
cs: Komerční služba

# task04_3_header_2
source: &#x2013; Safety of Life Service (SoL)
cs: - Commercial Service (CS)

# task04_3_desc
source: Velmi důležitou službou Galilea je také jeho zapojení do služeb, kde hrozí ohrožení lidských životů. Takovým odvětvím je například letecká doprava, pro kterou bude využita vylepšená verze Základní služby.
cs: Pokud uživatel potřebuje přesnější určení polohy (například při geodetických pracích), je možné využít Komerční službu systému Galileo. Tato placená služba poskytuje přesnější určení polohy zpřístupněním dalších dvou (pro běžného uživatele zakódovaných) signálů z každé družice.

# task04_4_header
source: Commercial Service (CS)
cs: Vyhledávací a záchranná služba

# task04_4_desc
source: If a user needs more accurate positioning (e.g. for surveying), they can use Galileo's Commercial Service. This paid service provides better positioning accuracy by giving the user access to two more signals from each satellite (encrypted for the common user).
cs: Nalezení pohřešované osoby, letadla, lodě, případně automobilu je účelem Vyhledávací a záchranné služby Galilea. Služba nouzové lokalizace umožňuje zachycení nouzových signálů ze zemského povrchu a předání jejich souřadnic složkám záchranných systémů.

# task04_5_header
source: Search and Rescue Service (SAR)
cs: Veřejně regulovaná služba

# task04_5_desc
source: The purpose of Galileo's SAR service is to help find missing persons, aircraft, ships and cars. This service makes it possible to receive distress signals from the Earth's surface and transfer the coordinates to search and rescue centres. The service will have the benefit of two-way communication.
cs: Tato služba bude primárně určená převážně státním institucím, jejichž hlavní náplní je bezpečnost. Služba je z důvodu bezpečnosti šifrovaná a chráněná proti rušení. Mohou ji využívat bezpečnostní složky a bezpečnostní agentury - např. pro transport důležitých osob, nebo pro převoz peněz a cenin.

# task04_6_desc
source: This service is primarily intended for government institutions responsible for security. For security reasons, the service is encrypted and protected against disturbances. It can be used by security forces and security agencies, e.g. for transporting important persons, money or valuable objects.
cs: Přiřaďte ke každé ze služeb Galilea její příklad použití.

# task05_1_title
source: What affects the performance of GNSS systems?
cs: Co způsobuje navigaci problémy?

# task05_1_text
source: The problems and inaccuracies found in satellite systems can be divided into two groups. The first group has to do with the satellite itself and its trajectory; the second is related to the signal a satellite sends towards the receiver.<br/>A critical factor for the satellite itself is its position, which is regularly checked and adjusted from ground stations. For the signal to work correctly, there are more factors to watch: the source of the signal, mounted on the satellite, but also the passage of the signal through the atmosphere, and possible disturbances.
cs: Problémy a nepřesnosti satelitní navigace lze rozdělit do dvou skupin. První skupina souvisí s družicí a její trajektorií, druhá se signálem vyslaným ze satelitu směrem k přijímači. Pro samotný satelit je důležitá hlavně jeho přesná poloha, která je pravidelně kontrolována a upravována z pozemních stanic.<br/>Pro správný chod signálu se řeší nejen jeho zdroj na satelitu, ale i průchod atmosférou a jeho rušení.

# task05_2_title
source: Impacts
cs: Nárazové ovlivnění

# task05_2_capt_a
source: Space objects
cs: Vesmírná tělesa

# task05_2_capt_b
source: Solar storms
cs: Solární bouře

# task05_2_capt_c
source: Space junk
cs: Kosmické smetí

# task05_2_desc_a
source: There are a great number of objects moving in the Solar System. Most of them are harmless for the Earth: they would burn down when passing through the atmosphere. For satellites, however, even small objects are very dangerous. A collision with a space object can cause the following problems: - damage to or loss of the satellite - deflection of the satellite from its orbit - destruction of / damage to solar panels - loss of communication - failure of the GPS transmitter.
cs: Ve vesmíru je velké množství objektů, které se pohybují Sluneční soustavou. Většina z nich je pro planetu Zemi neškodná, při průchodu atmosférou by totiž shořely. Pro satelity však i velmi malé objekty představují veliké nebezpečí. Srážka s vesmírným tělesem může způsobit následující poruchy: - poškození či úplná ztráta satelitu - vychýlení satelitu ze své orbity - zničení/poškození solárních panelů - ztráta komunikace - porucha vysílače GPS

# task05_2_desc_b
source: Satellites are constantly subjected to solar radiation pressure. In addition to radiation pressure, the Sun acts on satellites by showering them with particles from solar storms. Such particles cause the following issues: - deflection of a satellite from its original trajectory during a heavy storm - noise or complete loss of signal - possible damage to electronic equipment
cs: Družice jsou pod neustálým působením tlaku slunečního záření. Kromě tlaku záření působí Slunce na satelit i nárazově v podobě spršky částic ze solárních bouří. Tyto částice způsobují následující problémy: - odchýlení satelitu z původní dráhy při intenzivní bouři - šum signálu nebo jeho úplná ztráta - možné poškození elektroniky

# task05_2_desc_c
source: Space junk is a general term used for the thousands of fragments of defunct satellites, but also tools that astronauts dropped, that travel through space. Due to their very high speed, these small pieces can cause irreversible damage to sensitive devices such as satellites. A collision with a piece of space junk may result in: - damage to or loss of the satellite - deflection of the satellite from its orbit - destruction of / damage to solar panels - loss of communication - failure of the GPS transmitter
cs: Kosmické smetí je souhrnné označení pro tisíce úlomků nefunkčních družic, ale například i pro upuštěné nářadí astronautů, které putuje vesmírem. Díky velmi vysoké rychlosti i malé kousky mohou způsobit nevratné poškození citlivých zařízení, jakými jsou satelity. Srážka s kosmickým smetím může mít za následek: - poškození či úplná ztráta satelitu - vychýlení satelitu ze své orbity - zničení/poškození solárních panelů - ztráta komunikace - porucha vysílače GPS

# task05_3_title
source: Gravitational action of the Earth and other space objects
cs: Gravitační působení Země a dalších těles

# task05_3_text
source: The Earth's gravitational field is not entirely symmetrical: there are spots where gravity is weaker. Such small differences have an impact on satellites' trajectories. Even a small change in the position of a satellite can result in serious positioning inaccuracy; therefore, the influence of this phenomenon on trajectory needs to be compensated for. The gravitational fields of the Moon, the Sun and other large space objects have a similar effect.
cs: Gravitační pole Země není zcela symetrické; jsou místa, kde je gravitace slabší. Tyto drobné odchylky ovlivňují trajektorii satelitů. I nepatrná odchylka v poloze satelitu ovšem může způsobit velkou nepřesnost v určení polohy, a proto je potřeba trajektorie satelitů vůči těmto jevům korigovat. Obdobně na satelity působí gravitační pole Měsíce, Slunce a dalších velkých těles.

# task05_4_title
source: Radiation pressure
cs: Tlak záření

# task05_4_text
source: Radiation pressure is caused by the Sun's action of emitting photons. Photons travel through space, and their movement can affect the objects they hit. When photons collide with a satellite, they move it away from the Sun. Since a satellite's solar panels automatically turn towards the Sun to provide enough energy for the satellite, radiation pressure is the most important factor affecting the satellite's position.
cs: Tlak záření vyvolává Slunce vyzařováním fotonů. Fotony se šíří prostorem, přičemž svou hybností mohou působit na předměty, do nichž narazí. Při dopadu fotonů na satelit, dojde k jeho posunutí směrem od Slunce. Jelikož solární panely satelitu se svou plochou automaticky natáčejí směrem ke Slunci, aby družice měla dostatek energie, je tlak záření nejvýznamnějším faktorem ovlivňujícím polohu satelitu.

# task05_5_title
source: Solar wind
cs: Sluneční vítr

# task05_5_text
source: The Sun also emits streams of particles called the solar wind. It originates in the Sun's corona. The extremely hot upper atmosphere of the Sun (the temperature is several million degrees Celsius) makes it possible for the particles to escape the Sun's gravity. The intensity of the solar wind is approximately 10,000 times lower compared to solar radiation pressure. However, solar wind still presents a risk as the charged particles cause signal noise and, in the worst case, even failure of the satellite.
cs: Ze Slunce vychází také proud částic označovaný jako sluneční vítr. Jeho zdrojem je sluneční koróna. Extrémně horká svrchní vrstva sluneční atmosféry (teplota zde dosahuje několika milionů stupňů Celsia) umožňuje únik částic z blízkosti Slunce. Oproti tlaku slunečního záření je intenzita slunečního větru asi 10 000x menší. Přesto může být velmi nebezpečný, obsahuje totiž nabité částice způsobující šum signálu, v horším případě způsobí výpadek satelitu.

# task05_6_title
source: Interaction between a signal and the atmosphere
cs: Interakce signálu s atmosférou

# task05_6_text
source: On its way from a satellite to a receiver, signal has to pass through the Earth's atmosphere. Since satellite signals have the form of electromagnetic waves, effects we know from optics occur in the atmosphere: reflection, refraction, and slow-down by the individual layers of the atmosphere. The effect of signal refraction is most pronounced in the ionosphere, as this layer contains large amounts of charged particles, and in the lower atmospheric layers, as atmospheric density changes significantly with altitude. Signal reflection also occurs on the Earth's surface.
cs: Během pohybu od satelitu k přijímači musí signál projít zemskou atmosférou. Protože signál z družice má podobu elektromagnetických vln, dochází v atmosféře k jevům známým z optiky – odrazu, lomu a zpomalování v jednotlivých vrstvách atmosféry. Nejvíce se lom (refrakce) signálu projevuje v ionosféře, jelikož obsahuje velké množství nabitých částic a v nižších vrstvách atmosféry, jelikož se významně mění její hustota s výškou. K odrazům signálu dochází také na povrchu Země.

# task05_7_title
source: Special theory of relativity
cs: Speciální teorie relativity

# task05_7_text
source: Since satellites orbit the Earth at high speeds (3 km/s in a geostationary orbit), the functioning of atomic clocks is affected by relativistic effects (time dilation). If the trajectories were not adjusted using the special theory of relativity, the time differences would result in a positioning inaccuracy of approximately 57 m for each hour in orbit.
cs: Jelikož se satelity kolem Země pohybují vysokou rychlostí (3 km/s pro geostacionární orbitu), projevují se při chodu atomových hodin relativistické efekty (dilatace času). Pokud by se dráhy neupravovaly pomocí speciální teorie relativity, rozdíl času by způsobil chybu v přesnosti navigace cca 57 m za jednu hodinu oběhu.

# task05_8_title
source: General theory of relativity
cs: Obecná teorie relativity
